# Introduction to Pandas dataframe

Data frame is a main object in pandas. It is used to represent data with rows and columns

Data frame is a datastructure represent the data in tabular or excel spread sheet like data)

**creating dataframe:**

In [4]:
import pandas as pd
df = pd.read_excel("weather_data.csv")   #read weather.csv data
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [5]:
dir(pd)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_is_numpy_dev',
 '_lib',
 '_libs',
 '_np_version_under1p18',
 '_testing',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [7]:
import numpy as np

In [32]:
#list of tuples

weather_data = [('1/1/2017', np.nan, 6, 'Rain'),
                ('1/2/2017', 35, 7, 'Sunny'),
                ('1/3/2017', 28, np.nan, 'Snow'),
                ('1/4/2017', 24, 7, 'Snow'),
                ('1/5/2017', 32, 4, 'Rain'),
                ('1/6/2017', np.nan, 2, 'Sunny')
               ]


df = pd.DataFrame(weather_data, columns=['day', 'temperature', 'windspeed', 'event'])
df

        day  temperature  windspeed  event
0  1/1/2017          NaN        6.0   Rain
1  1/2/2017         35.0        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017         24.0        7.0   Snow
4  1/5/2017         32.0        4.0   Rain
5  1/6/2017          NaN        2.0  Sunny

In [16]:
a = {"Name":["A","B","C"],
     "Age": [23,42,45],
     "Gender":["M","F","M"]}

In [17]:
b = pd.DataFrame(a)
b

  Name  Age Gender
0    A   23      M
1    B   42      F
2    C   45      M

In [29]:
df_test = pd.read_excel(r"C:\Users\Devdatta Supnekar\Downloads\weather_data_cities.xlsx",sheet_name=0)

In [30]:
df_test

          day      city  temperature  windspeed   event
0  2017-01-01  new york         32.0        6.0    Rain
1  2017-01-02  new york         36.0        7.0   Sunny
2  2017-01-03  new york         28.0       12.0    Snow
3  2017-01-04  new york         33.0        7.0   Sunny
4  2017-01-01    mumbai         90.0        5.0   Sunny
5  2017-01-02    mumbai         85.0       12.0     Fog
6  2017-01-03    mumbai         87.0       15.0     Fog
7  2017-01-04    mumbai         92.0        5.0    Rain
8  2017-01-01     paris         45.0       20.0   Sunny
9  2017-01-02     paris         50.0       13.0  Cloudy
10 2017-01-03     paris         54.0        8.0  Cloudy
11 2017-01-04     paris         42.0       10.0  Cloudy

In [34]:
df.isna().sum()

day            0
temperature    2
windspeed      1
event          0
dtype: int64

In [35]:
#get dimentions of the table

df.shape   #total number of rows and columns

(6, 4)

In [36]:
#if you want to see initial some rows then use head command (default 5 rows)
df.head()

        day  temperature  windspeed  event
0  1/1/2017          NaN        6.0   Rain
1  1/2/2017         35.0        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017         24.0        7.0   Snow
4  1/5/2017         32.0        4.0   Rain

In [37]:
#if you want to see last few rows then use tail command (default last 5 rows will print)
df.tail()

        day  temperature  windspeed  event
1  1/2/2017         35.0        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017         24.0        7.0   Snow
4  1/5/2017         32.0        4.0   Rain
5  1/6/2017          NaN        2.0  Sunny

In [41]:
df.loc[2:5,["day","temperature"]]

        day  temperature
2  1/3/2017         28.0
3  1/4/2017         24.0
4  1/5/2017         32.0
5  1/6/2017          NaN

In [42]:
#slicing
df.iloc[2:5,0:2]

        day  temperature
2  1/3/2017         28.0
3  1/4/2017         24.0
4  1/5/2017         32.0

In [43]:
df.columns   #print columns in a table

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [44]:
df.da y      #print particular column data

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [ ]:
#another way of accessing column
df['da y'] #df.day (both are same)

In [45]:
#get 2 or more columns
df[['day', 'event']]

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [46]:
#get all temperatures
df['temperature']

0     NaN
1    35.0
2    28.0
3    24.0
4    32.0
5     NaN
Name: temperature, dtype: float64

In [47]:
#print max temperature
df['temperature'].max()

35.0

In [48]:
#print max temperature
df['temperature'].min()

24.0

In [49]:
#print max temperature
df['temperature'].describe()

count     4.000000
mean     29.750000
std       4.787136
min      24.000000
25%      27.000000
50%      30.000000
75%      32.750000
max      35.000000
Name: temperature, dtype: float64

In [50]:
df.temperature == df.temperature.max()

0    False
1     True
2    False
3    False
4    False
5    False
Name: temperature, dtype: bool

In [55]:
# select rows which has maximum temperature
df[df.temperature == df.temperature.max()]

        day  temperature  windspeed  event
1  1/2/2017         35.0        7.0  Sunny

In [56]:
#select only day column which has maximum temperature
df.day[df.temperature == df.temperature.max()]

1    1/2/2017
Name: day, dtype: object